//
//  PostArray.swift
//  SwiftUIApp
//
//  Created by Слава Орлов on 07.07.2023.
//

import Foundation
import SwiftUI

var catPost = Post(title: "Кошка", description: "Кошка — домашнее животное, одно из наиболее популярных «животных-компаньонов».С точки зрения научной систематики, домашняя кошка — млекопитающее семейства кошачьих отряда хищных. Одни исследователи рассматривают домашнюю кошку как подвид дикой кошки, другие — как отдельный биологический вид.Являясь одиночным охотником на грызунов и других мелких животных, кошка — социальное животное, использующее для общения широкий диапазон звуковых сигналов, а также феромоны и движения тела.В настоящее время в мире насчитывается около 600 млн домашних кошек, выведено около 200 пород, от длинношёрстных (персидская кошка) до лишённых шерсти (сфинксы), признанных и зарегистрированных различными фелинологическими организациями.", imageName: "Cat")

var spartacusPost = Post(title: "Восстание Спартака", description: "Спартак погиб в апреле 71 года до н. э. на реке Силари, Апулия — руководитель восстания рабов и гладиаторов в Италии в 73—71 годах до н. э. Был фракийцем, при неясных обстоятельствах стал рабом, а позже — гладиатором. В 73 году до н. э. вместе с 70 сторонниками бежал из гладиаторской школы в Капуе, укрылся на Везувии и разбил высланный против него отряд. В дальнейшем смог создать сильную и относительно дисциплинированную армию из рабов и италийской бедноты и нанести римлянам ряд серьёзных поражений. В 72 году до н. э. он разбил обоих консулов, его армия выросла, по разным сведениям, до 70 или даже до 120 тысяч человек. С боями Спартак дошёл до северных границ Италии, по-видимому, предполагая перейти Альпы, но потом повернул обратно.", imageName: "Spartacus")

var spacePost = Post(title: "Космос", description: "Относительно пустые участки Вселенной, которые лежат вне границ атмосфер небесных тел. Космос не является абсолютно пустым пространством: в нём есть, хотя и с очень низкой плотностью, межзвёздное вещество, космические лучи и электромагнитное излучение, а также гипотетическая тёмная материя.  ", imageName: "Space")
var spbPost = Post(title: "Санкт-Петербург", description: "Второй по численности населения город России. Город федерального значения. Административный центр Северо-Западного федерального округа. Основан 27 мая 1703 года царём Петром I. В 1714-1728 и 1732-1918 годах - столица Российского государства. ", imageName: "SPB")
var kiaPost = Post(title: "KIA Motors", description: "Южнокорейская автомобилестроительная компания, второй автопроизводитель в Республике Корея. Основана в декабре 1944 года, после банкротства в 1997 году вошла в состав Hyundai Motor Group.", imageName: "KIA")

var posts: [Post] = [catPost,spartacusPost,spacePost,spbPost,kiaPost]
